
## Plan Result (terraform/aws/openhands)

[CI link](https://github.com/boxp/arch/actions/runs/13760177685)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 6 to destroy.</code></pre>

* Create
  * aws_iam_access_key.ssm_reader_user_key
  * aws_iam_policy.ssm_reader_policy
  * aws_iam_user.ssm_reader_user
  * aws_iam_user_policy_attachment.ssm_reader_policy_attachment
  * aws_ssm_parameter.ssm_reader_access_key_id
  * aws_ssm_parameter.ssm_reader_secret_access_key
* Delete
  * aws_iam_access_key.bedrock_user_key
  * aws_iam_policy.bedrock_policy
  * aws_iam_user.bedrock_user
  * aws_iam_user_policy_attachment.bedrock_policy_attachment
  * aws_ssm_parameter.bedrock_access_key_id
  * aws_ssm_parameter.bedrock_secret_access_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_access_key.bedrock_user_key will be destroyed
  # (because aws_iam_access_key.bedrock_user_key is not in configuration)
  - resource "aws_iam_access_key" "bedrock_user_key" {
      - create_date          = "2025-03-07T18:07:55Z" -> null
      - id                   = "AKIA4HAN3H4RJTDEZYDS" -> null
      - secret               = (sensitive value) -> null
      - ses_smtp_password_v4 = (sensitive value) -> null
      - status               = "Active" -> null
      - user                 = "bedrock-openhands-user" -> null
    }

  # aws_iam_access_key.ssm_reader_user_key will be created
  + resource "aws_iam_access_key" "ssm_reader_user_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssm-reader-openhands-user"
    }

  # aws_iam_policy.bedrock_policy will be destroyed
  # (because aws_iam_policy.bedrock_policy is not in configuration)
  - resource "aws_iam_policy" "bedrock_policy" {
      - arn              = "arn:aws:iam::839695154978:policy/bedrock-openhands-policy" -> null
      - attachment_count = 1 -> null
      - description      = "Policy for accessing AWS Bedrock Claude 3.7 Sonnet" -> null
      - id               = "arn:aws:iam::839695154978:policy/bedrock-openhands-policy" -> null
      - name             = "bedrock-openhands-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "bedrock:InvokeModel",
                          - "bedrock:InvokeModelWithResponseStream",
                          - "bedrock:GetModelCustomizationJob",
                          - "bedrock:ListModelCustomizationJobs",
                          - "bedrock:ListFoundationModels",
                          - "bedrock:GetFoundationModel",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:bedrock:us-west-2:839695154978:inference-profile/us.anthropic.claude-3-7-sonnet-20250219-v1:0",
                          - "arn:aws:bedrock:us-east-1::foundation-model/anthropic.claude-3-7-sonnet-20250219-v1:0",
                          - "arn:aws:bedrock:us-east-2::foundation-model/anthropic.claude-3-7-sonnet-20250219-v1:0",
                          - "arn:aws:bedrock:us-west-2::foundation-model/anthropic.claude-3-7-sonnet-20250219-v1:0",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA4HAN3H4RMOQ5HIM2I" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # aws_iam_policy.ssm_reader_policy will be created
  + resource "aws_iam_policy" "ssm_reader_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for reading SSM parameters"
      + id               = (known after apply)
      + name             = "ssm-reader-openhands-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-west-2:839695154978:parameter/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_user.bedrock_user will be destroyed
  # (because aws_iam_user.bedrock_user is not in configuration)
  - resource "aws_iam_user" "bedrock_user" {
      - arn           = "arn:aws:iam::839695154978:user/service/bedrock-openhands-user" -> null
      - force_destroy = false -> null
      - id            = "bedrock-openhands-user" -> null
      - name          = "bedrock-openhands-user" -> null
      - path          = "/service/" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - unique_id     = "AIDA4HAN3H4ROY764DNG6" -> null
    }

  # aws_iam_user.ssm_reader_user will be created
  + resource "aws_iam_user" "ssm_reader_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ssm-reader-openhands-user"
      + path          = "/service/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.bedrock_policy_attachment will be destroyed
  # (because aws_iam_user_policy_attachment.bedrock_policy_attachment is not in configuration)
  - resource "aws_iam_user_policy_attachment" "bedrock_policy_attachment" {
      - id         = "bedrock-openhands-user-20250307180755834100000001" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/bedrock-openhands-policy" -> null
      - user       = "bedrock-openhands-user" -> null
    }

  # aws_iam_user_policy_attachment.ssm_reader_policy_attachment will be created
  + resource "aws_iam_user_policy_attachment" "ssm_reader_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ssm-reader-openhands-user"
    }

  # aws_ssm_parameter.bedrock_access_key_id will be destroyed
  # (because aws_ssm_parameter.bedrock_access_key_id is not in configuration)
  - resource "aws_ssm_parameter" "bedrock_access_key_id" {
      - arn         = "arn:aws:ssm:ap-northeast-1:839695154978:parameter/bedrock-access-key-id" -> null
      - data_type   = "text" -> null
      - description = "AWS Access Key ID for Bedrock service" -> null
      - id          = "bedrock-access-key-id" -> null
      - key_id      = "alias/aws/ssm" -> null
      - name        = "bedrock-access-key-id" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - tier        = "Standard" -> null
      - type        = "SecureString" -> null
      - value       = (sensitive value) -> null
      - version     = 1 -> null
    }

  # aws_ssm_parameter.bedrock_secret_access_key will be destroyed
  # (because aws_ssm_parameter.bedrock_secret_access_key is not in configuration)
  - resource "aws_ssm_parameter" "bedrock_secret_access_key" {
      - arn         = "arn:aws:ssm:ap-northeast-1:839695154978:parameter/bedrock-secret-access-key" -> null
      - data_type   = "text" -> null
      - description = "AWS Secret Access Key for Bedrock service" -> null
      - id          = "bedrock-secret-access-key" -> null
      - key_id      = "alias/aws/ssm" -> null
      - name        = "bedrock-secret-access-key" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - tier        = "Standard" -> null
      - type        = "SecureString" -> null
      - value       = (sensitive value) -> null
      - version     = 1 -> null
    }

  # aws_ssm_parameter.ssm_reader_access_key_id will be created
  + resource "aws_ssm_parameter" "ssm_reader_access_key_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AWS Access Key ID for SSM Parameter Reader"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "ssm-reader-access-key-id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.ssm_reader_secret_access_key will be created
  + resource "aws_ssm_parameter" "ssm_reader_secret_access_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AWS Secret Access Key for SSM Parameter Reader"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "ssm-reader-secret-access-key"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2893,"Program":"tfcmt","SHA1":"49961770aeba40e693025a96910265256191aac2","Target":"terraform/aws/openhands","Vars":{},"WorkflowName":"pull_request_target"} -->